app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def current_user
        if decoded_token
            if user_id=decoded_token[0]["user_id"]
              @user=User.find(user_id)