app/controllers/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "trial@run.com"], ["LIMIT", 1]]
---
    def create
        #find user by email if present
        @user=User.find_by(email: params[:email])