app/controllers/books_controller.rb

SELECT "user_books".* FROM "user_books" WHERE "user_books"."book_id" = ?  [["book_id", 1]]
---
    def index
        @books=Book.all

INSERT INTO "books" ("title", "author", "genres", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["author", ""], ["genres", ""], ["created_at", "2018-08-23 14:34:53.443509"], ["updated_at", "2018-08-23 14:34:53.443509"]]
SELECT "books".* FROM "books"
---
    def create
        @book=Book.new(title: book_params[:title], author: book_params[:author], pages: book_params[:pages], genres: book_params[:genres])
        @book.save
        render json: Book.all

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "books"
---
    def stats
        @books=Book.all
        render json: {books_read: @books.count, genres_read: Book.all_genres, most_recent_book: Book.most_recent.title}