app/controllers/entries_controller.rb

    def create
        @user_book=UserBook.find(entry_params[:user_book_id])
        @entry=Entry.new(book_id: @user_book.book_id, time: entry_params[:time], pages: entry_params[:pages], user_id: current_user.id, user_book_id: @user_book.id)
        @entry.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "entries" ("title", "time", "pages", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "436"], ["time", 3], ["pages", 43], ["created_at", "2018-08-18 00:26:03.758121"], ["updated_at", "2018-08-18 00:26:03.758121"]]