app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries"
---
    def create
        @entry=Entry.new(book_id: entry_params[:book_id], time: entry_params[:time], pages: entry_params[:pages])
        @entry.save
        render json: Entry.all