app/controllers/users_controller.rb

    def me

        #this route requies an authorization header be sent with the JWT token
        authHeader=request.headers["Authorization"]

        #select and decode the JWT
        token=authHeader.split(" ")[1]
        decoded=JWT.decode(token,"flobble", true, {algorithm: "HS256"})
        user_id=decoded[0]["user_id"]

        #We good.
        @user=User.find(user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]