app/models/book.rb

SELECT "entries".* FROM "entries" WHERE "entries"."book_id" = ?  [["book_id", 1]]
SELECT "user_books".* FROM "user_books" WHERE "user_books"."book_id" = ?  [["book_id", 5]]
---
    def pages_read
        pages=0
        self.entries.each{|ent| pages+=ent.pages}

SELECT "books".* FROM "books"
---
    def self.all_genres
        self.all.collect{|book| book.genres}.join(", ")