app/models/entry.rb

    def get_pages_read
        @entries=self.user_book.entries.order(entry_page: :desc)
        if @entries.count>1
---
SELECT COUNT(*) FROM "books"
SELECT "books".* FROM "books"
SELECT "entries".* FROM "entries"